In [1]:
import pandas as pd 
import numpy as np

In [3]:
s = pd.Series([1,3,4,np.nan,6,8])
s

0    1.0
1    3.0
2    4.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range('20130101',periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01 -0.340030  2.346573 -0.201436 -0.819540
2013-01-02  0.604307 -1.153886 -1.533426 -0.002791
2013-01-03  0.925771  0.160723  0.193839 -0.229345
2013-01-04 -0.006736  0.074416 -2.313521  0.289876
2013-01-05 -0.550094  0.608648 -0.104461 -2.384423
2013-01-06 -0.062361  0.807296 -0.170865  0.879019

In [7]:
df.head(3)

                   A         B         C         D
2013-01-01 -0.340030  2.346573 -0.201436 -0.819540
2013-01-02  0.604307 -1.153886 -1.533426 -0.002791
2013-01-03  0.925771  0.160723  0.193839 -0.229345

In [8]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [10]:
df.values

array([[-0.34003005,  2.34657345, -0.20143564, -0.81953968],
       [ 0.60430683, -1.15388585, -1.53342601, -0.00279127],
       [ 0.92577084,  0.16072323,  0.19383922, -0.22934471],
       [-0.00673575,  0.07441579, -2.31352134,  0.28987569],
       [-0.55009432,  0.6086475 , -0.1044615 , -2.38442328],
       [-0.0623606 ,  0.80729603, -0.1708648 ,  0.87901922]])

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [12]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.095143  0.473962 -0.688312 -0.377867
std    0.563930  1.143990  0.997937  1.132230
min   -0.550094 -1.153886 -2.313521 -2.384423
25%   -0.270613  0.095993 -1.200428 -0.671991
50%   -0.034548  0.384685 -0.186150 -0.116068
75%    0.451546  0.757634 -0.121062  0.216709
max    0.925771  2.346573  0.193839  0.879019

In [13]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-01 -0.340030  2.346573 -0.201436 -0.819540
2013-01-06 -0.062361  0.807296 -0.170865  0.879019
2013-01-05 -0.550094  0.608648 -0.104461 -2.384423
2013-01-03  0.925771  0.160723  0.193839 -0.229345
2013-01-04 -0.006736  0.074416 -2.313521  0.289876
2013-01-02  0.604307 -1.153886 -1.533426 -0.002791

In [14]:
df

                   A         B         C         D
2013-01-01 -0.340030  2.346573 -0.201436 -0.819540
2013-01-02  0.604307 -1.153886 -1.533426 -0.002791
2013-01-03  0.925771  0.160723  0.193839 -0.229345
2013-01-04 -0.006736  0.074416 -2.313521  0.289876
2013-01-05 -0.550094  0.608648 -0.104461 -2.384423
2013-01-06 -0.062361  0.807296 -0.170865  0.879019

In [15]:
df['A']

2013-01-01   -0.340030
2013-01-02    0.604307
2013-01-03    0.925771
2013-01-04   -0.006736
2013-01-05   -0.550094
2013-01-06   -0.062361
Freq: D, Name: A, dtype: float64

In [16]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.340030  2.346573 -0.201436 -0.819540
2013-01-02  0.604307 -1.153886 -1.533426 -0.002791
2013-01-03  0.925771  0.160723  0.193839 -0.229345

In [18]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.604307 -1.153886 -1.533426 -0.002791
2013-01-03  0.925771  0.160723  0.193839 -0.229345
2013-01-04 -0.006736  0.074416 -2.313521  0.289876

In [19]:
df.loc[dates[0]]

A   -0.340030
B    2.346573
C   -0.201436
D   -0.819540
Name: 2013-01-01 00:00:00, dtype: float64

In [20]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.340030  2.346573
2013-01-02  0.604307 -1.153886
2013-01-03  0.925771  0.160723
2013-01-04 -0.006736  0.074416
2013-01-05 -0.550094  0.608648
2013-01-06 -0.062361  0.807296

In [21]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.604307 -1.153886
2013-01-03  0.925771  0.160723
2013-01-04 -0.006736  0.074416

In [22]:
df.loc[dates[0],'A']

-0.3400300482342485

In [23]:
df.iloc[3]

A   -0.006736
B    0.074416
C   -2.313521
D    0.289876
Name: 2013-01-04 00:00:00, dtype: float64

In [24]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.006736  0.074416
2013-01-05 -0.550094  0.608648

In [25]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.604307 -1.533426
2013-01-03  0.925771  0.193839
2013-01-05 -0.550094 -0.104461

In [26]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.604307 -1.153886 -1.533426 -0.002791
2013-01-03  0.925771  0.160723  0.193839 -0.229345

In [27]:
df.iloc[:,1:3]

                   B         C
2013-01-01  2.346573 -0.201436
2013-01-02 -1.153886 -1.533426
2013-01-03  0.160723  0.193839
2013-01-04  0.074416 -2.313521
2013-01-05  0.608648 -0.104461
2013-01-06  0.807296 -0.170865

In [28]:
df

                   A         B         C         D
2013-01-01 -0.340030  2.346573 -0.201436 -0.819540
2013-01-02  0.604307 -1.153886 -1.533426 -0.002791
2013-01-03  0.925771  0.160723  0.193839 -0.229345
2013-01-04 -0.006736  0.074416 -2.313521  0.289876
2013-01-05 -0.550094  0.608648 -0.104461 -2.384423
2013-01-06 -0.062361  0.807296 -0.170865  0.879019

In [29]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  0.604307 -1.153886 -1.533426 -0.002791
2013-01-03  0.925771  0.160723  0.193839 -0.229345

In [30]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN  2.346573       NaN       NaN
2013-01-02  0.604307       NaN       NaN       NaN
2013-01-03  0.925771  0.160723  0.193839       NaN
2013-01-04       NaN  0.074416       NaN  0.289876
2013-01-05       NaN  0.608648       NaN       NaN
2013-01-06       NaN  0.807296       NaN  0.879019

In [31]:
df2 = df.copy()

In [32]:
df2['E'] = ['one','one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -0.340030  2.346573 -0.201436 -0.819540    one
2013-01-02  0.604307 -1.153886 -1.533426 -0.002791    one
2013-01-03  0.925771  0.160723  0.193839 -0.229345    two
2013-01-04 -0.006736  0.074416 -2.313521  0.289876  three
2013-01-05 -0.550094  0.608648 -0.104461 -2.384423   four
2013-01-06 -0.062361  0.807296 -0.170865  0.879019  three

In [33]:
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [34]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.925771  0.160723  0.193839 -0.229345   two
2013-01-05 -0.550094  0.608648 -0.104461 -2.384423  four

In [35]:
df

                   A         B         C         D
2013-01-01 -0.340030  2.346573 -0.201436 -0.819540
2013-01-02  0.604307 -1.153886 -1.533426 -0.002791
2013-01-03  0.925771  0.160723  0.193839 -0.229345
2013-01-04 -0.006736  0.074416 -2.313521  0.289876
2013-01-05 -0.550094  0.608648 -0.104461 -2.384423
2013-01-06 -0.062361  0.807296 -0.170865  0.879019

In [36]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.340030  2.346573 -0.201436 -0.819540
2013-01-02  0.264277  1.192688 -1.734862 -0.822331
2013-01-03  1.190048  1.353411 -1.541022 -1.051676
2013-01-04  1.183312  1.427827 -3.854544 -0.761800
2013-01-05  0.633218  2.036474 -3.959005 -3.146223
2013-01-06  0.570857  2.843770 -4.129870 -2.267204

In [37]:
df.apply(lambda x : x.max() - x.min())

A    1.475865
B    3.500459
C    2.507361
D    3.263442
dtype: float64